* Agassiz 79b borehole
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | agassiz79b
Alternate name                        | Agassiz ice cap 1979B borehole
Data source                           | WIC Email
Drill year(s)                         | nan
Data year(s)                          | 1979
Longitude [°E]                        | -73.1
Latitude [°N]                         | 80.7
Approximate location name             | Agassiz Ice Cap
Location source                       | See data source
Ice thickness [m]                     | 141.2
ice thickness year                    | nan
Ice thickness source                  | See data source
Surface velocity [m yr^-1]            | nan
Surface velocity year                 | nan
Surface velocity source               | nan
Measured from: Top, Bottom, Relative  | T
Depth of top measurement [m]          | 11.0
Depth of bottom measurement [m]       | 141.0
Coverage [% of thickness]             | 92
#+end_example

** Temperature

+ Data provided by 3rd party in XLSX format, converted to CSV.
+ WIC Email: [[mu4e:msgid:AM0PR04MB6129DE88C9253A951702EE06A2F30@AM0PR04MB6129.eurprd04.prod.outlook.com][Agassiz x4]]
+ See also [[citet:clarke_1987_wind][Clark (1987)]] Figure 2.

#+BEGIN_example
From: William Colgan
To: Ken Mankoff
Subject: Agassiz x4
Date: Wed 02 Dec 2020 04:54:17 AM PST
Attachments: [1]Agassiz borehole T profiles.xlsx(19.6K)

Here are 4x Agassiz Ice Cap temperature profiles. All to bedrock, and
all from within 2 km of the same 80.70N and 73.10W coordinate in the
file.

Fra: Christian Zdanowicz
Sendt: 2. december 2020 13:27
Til: William Colgan <wic@geus.dk>
Emne: RE: Prince of Wales - ice temperature?

The Agassiz T profiles are from the 1977, 1979 and 1984 boreholes, all
down to bedrock. I do not have more precise information on the
measurements or on the location of the boreholes than what was
published (see other attached papers).

David Fisher deserves the credit for all these data, I did not
generate them. You can use his Univ. of Ottawa affiliation: Department
of Earth and Environmental Sciences, University of Ottawa, Ottawa,
Canada, K1N 6N5.
#+END_example

** Thickness

From email (above) stating that profile goes to bedrock.

** Location

Provided in email. Note: "within 2 km of".

** Velocity

Unknown

** Data                                                 :noexport:

#+BEGIN_SRC bash :exports results
cat data.csv| sort -t, -n -k1
#+END_SRC

#+RESULTS:
|     d |      t |
|  11.2 |  -22.3 |
|  16.2 | -22.26 |
|  21.2 | -22.16 |
|  26.2 | -22.01 |
|  31.2 | -21.88 |
|  36.2 | -21.75 |
|  41.2 | -21.62 |
|  46.2 | -21.51 |
|  51.2 | -21.42 |
|  56.2 | -21.28 |
|  61.2 | -21.18 |
|  66.2 | -21.06 |
|  71.2 | -20.94 |
|  76.2 | -20.83 |
|  81.2 | -20.71 |
|  86.2 | -20.56 |
|  91.2 | -20.43 |
|  96.2 | -20.29 |
| 101.2 | -20.15 |
| 106.2 | -20.03 |
| 111.2 | -19.87 |
| 116.2 | -19.73 |
| 121.2 | -19.58 |
| 126.2 | -19.43 |
| 131.2 | -19.28 |
| 136.2 | -19.14 |
| 141.2 | -19.05 |

